Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags
Polymesh check flags, consistent with toolkits geometry::PolymeshCheckerOption_e

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.VerticesOnSameEdge
To check outerloop vertices on same edge, distance tolerance 0.01

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.LoopNormalValidity
To check innerloop's normal.

Tekla.Structures.Model.Polymesh.PolymeshCheckerFlags.Multishellness
To check multiple shellness.